# 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции.

# array = [2, 13, 105, 4, 12, 7, 54, 101, 205, 1, 2]
# summa = 0
# for i in range(1, len(array), 2):
#     summa += array[i]
#
# print(summa)

# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.